{'title': 'Command & Conquer - The Ultimate Collection (PC)', 'genre': [], 'pub': [], 'dev': [], 'Req_max': None, 'Req_min': None, 'description': "\nCommand & Conquer - The Ultimate Collection (PC) Game Key\nCommand and Conquer The Ultimate Collection is the full collection of the Command and Conquer franchise.\nBuy Command & Conquer - The Ultimate Collection (PC) Game Key\xa0and get your Key for Origin activation within minutes via email! Use the key to access your highspeed download of your received game. Don't miss out this offer, buy Command & Conquer - The Ultimate Collection (PC) Game Key\xa0now!\nBuy Command & Conquer - The Ultimate Collection Game Key\nBuy Command & Conquer - The Ultimate Collection game code and get your key for Steam activation within minutes via email! Use the key to access your highspeed download of your received game. Don't miss out this offer.\n\nAbout This Game\n17 games. 3 universes. 1 awesome value.\n17 Command and Conquer titles in one! Rediscover the groundbreaking, action-packed series that changed PC gaming forever with Command & Conquer The Ultimate Collection for PC download. Known for their frenetic real-time-strategy combat system, massive insane war machines, and campy banter, the three Command and Conquer universes are as addictive as ever. Fight as the Global Defense Initiative or the Brotherhood of Nod as they clash over the rare mineral Tiberium in the classic original series, now updated to run on the Windows Vista and Windows 7 operating systems. Challenge the red menace in an alternate universe in Red Alert. Then step into the near future with Generals as China and the United States battle the Global Liberation Army, a terrorist organization hell-bent on bringing the world to its knees! Rule all three Command & Conquer universes with this incredible value – including 17 games and more!\nThis amazing collection includes:\n\nCommand & Conquer\nCommand & Conquer The Covert Operations\nCommand & Conquer Red Alert\nCommand & Conquer Red Alert Counterstrike\nCommand & Conquer Red Alert The Aftermath\nCommand & Conquer Tiberian Sun\nCommand & Conquer Tiberian Sun Firestorm\nCommand & Conquer Red Alert 2\nCommand & Conquer Red Alert Yuri’s Revenge\nCommand & Conquer Renegade\nCommand & Conquer Generals\nCommand & Conquer Generals Zero Hour\nCommand & Conquer 3 Tiberium Wars\nCommand & Conquer 3 Kane’s Wrath\nCommand & Conquer Red Alert 3\nCommand & Conquer Red Alert 3 Uprising\nCommand & Conquer 4 Tiberian Twilight\nEarly access to the next Command & Conquer game\n\n\n"}