{'title': 'Fahrenheit: Indigo Prophecy Remastered', 'genre': [], 'pub': [], 'dev': [], 'Req_max': None, 'Req_min': None, 'description': "\nDescription\n\n\nSummaryGuilt is a chilling feeling…Originally released in 2005, Fahrenheit (known as Indigo Prophecy in North America) was a breakthrough in interactive narrative, teetering between the worlds of cinema and gaming while also embracing them, carving its own unique genre in the entertainment landscape. This newly remastered edition features updated graphics, full controller support AND is based on the uncut/uncensored international version of the game.With a rich multilayered narrative, innovative presentation, and a chilling musical score by famed Hollywood composer Angelo Badalementi, Fahrenheit: Indigo Prophecy Remastered serves as the definitive version of the supernatural murder mystery and (re)introduces the groundbreaking title to old and new fans alike. Features\n\nInteractive Drama — An intuitive control scheme and spectacular split-screen presentation complement the game's mysterious noir narrative.\xa0\nExtensive Replayability — With branching dialog and multiple endings, each playthrough of the game yields a different outcome.\xa0\nMultiple Characters — Take control of the narrative through four different playable characters, each illuminating a different perspective of the story.\xa0\nFully Voiced Script — Every line from the extensive script is voiced by professional actors in English, French, German, and Spanish.\nCinematic Score — Fahrenheit features a fully orchestrated score composed by Angelo Badalamenti, famous for his extensive work with director David Lynch.\xa0\nUncut Version of the Game — Unlike the original North American release.\n\nRemastered contains all of the game's original scenes, uncensored and uncut. Key Upgrades\n\nHigh-definition Graphics - All of the in-game textures have been meticulously recreated in HD\xa0\nWidescreen Support - A true widescreen (not cropped) view strengthens the game's cinematic qualities while also providing players with a better sense of their surroundings.\xa0\nFull Controller Support - Support for Sony and Microsoft controllers for desktop platforms.\nLive Graphics Comparison - Players can switch between the updated visuals and the original art assets with an in-game menu option.\xa0\n\n© 2015 Published and distributed by Aspyr Media, Inc. “Aspyr” and the Aspyr “star” logo are federally registered trademarks of Aspyr Media, Inc.\n\nRead more about Fahrenheit: Indigo Prophecy Remastered \nShow less about Fahrenheit: Indigo Prophecy Remastered \n\n"}