{'title': 'Sid Meier’s Civilization® VI - Digital Deluxe', 'genre': [], 'pub': [], 'dev': [], 'Req_max': None, 'Req_min': None, 'description': "\nDescription\n\n\nUse of this product requires agreement to the following third party end user license agreement:\xa0http://www.take2games.com/eula/Reviews“I’ll never need another\xa0Civ\xa0game in my life besides this one” –\xa0PC Gamer\xa0(93 out of 100)“It’s just the beginning of a new\xa0Civ\xa0chapter, and what a glorious, confident beginning it is.” –\xa0PCGamesN\xa0(9 out of 10)“Possibly the biggest and deepest game in the series' 25-year history.” –\xa0IGNDigital DeluxeExpand your empire further with the Civilization VI Digital Deluxe which includes the full base game, the 25th Anniversary Digital Soundtrack, and access to six DLC packs* that will add new civilizations, leaders, scenarios, and more for a bundled discount: \n\nCivilization VI – Vikings Scenario Pack\nCivilization VI – Poland Civilization & Scenario Pack\nCivilization VI – Australia Civilization & Scenario Pack\nCivilization VI – Persia and Macedon Civilization & Scenario Pack\nCivilization VI – Nubia Civilization & Scenario Pack\xa0\nCivilization VI – Khmer and Indonesia Civilization & Scenario Pack\n\n*Save vs buying DLC packs a la carte. Individual DLC may be sold separately. If you purchase the Digital Deluxe, do not also purchase these standalone packs, as you will be charged for them.SummaryOriginally created by legendary game designer Sid Meier, Civilization is a turn-based strategy game in which you attempt to build an empire to stand the test of time. Become Ruler of the World by establishing and leading a civilization from the Stone Age to the Information Age. Wage war, conduct diplomacy, advance your culture, and go head-to-head with history’s greatest leaders as you attempt to build the greatest civilization the world has ever known. Civilization VI offers new ways to engage with your world: cities now physically expand across the map, active research in technology and culture unlocks new potential, and competing leaders will pursue their own agendas based on their historical traits as you race for one of five ways to achieve victory in the game. \n\nEXPANSIVE EMPIRES:See the marvels of your empire spread across the map like never before. Each city spans multiple tiles so you can custom build your cities to take full advantage of the local terrain.\xa0\nACTIVE RESEARCH:Unlock boosts that speed your civilization’s progress through history. To advance more quickly, use your units to actively explore, develop your environment, and discover new cultures.\xa0\nDYNAMIC DIPLOMACY:Interactions with other civilizations change over the course of the game, from primitive first interactions where conflict is a fact of life, to late game alliances and negotiations.\xa0\nCOMBINED ARMS:Expanding on the “one unit per tile” design, support units can now be embedded with other units, like anti-tank support with infantry, or a warrior with settlers. Similar units can also be combined to form powerful “Corps” units.\xa0\nENHANCED MULTIPLAYER:In addition to traditional multiplayer modes, cooperate and compete with your friends in a wide variety of situations all designed to be easily completed in a single session.\xa0\nA CIV FOR ALL PLAYERS:Civilization VI provides veteran players new ways to build and tune their civilization for the greatest chance of success. New tutorial systems introduce new players to the underlying concepts so they can easily get started.\n\n\nRead more about Sid Meier’s Civilization® VI - Digital Deluxe \nShow less about Sid Meier’s Civilization® VI - Digital Deluxe \n\n"}